sCO2Channel-DES_1.03_500_20_ACI/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 2E-7;

boundaryField
{
    BotWall1
    {
        type            fixedValue;
        value           uniform 0;		
    }
    BotWall2
    {
        type            fixedValue;
        value           uniform 0;		
    }
    OtherWalls
    {
        type            fixedValue;
        value           uniform 0;
    }
    Inlet
    {
        type            fixedValue;
        value           uniform 2E-7;
    }
    Outlet
    {
        type            zeroGradient;
    }
    CenterPlane
    {
        type            symmetryPlane;
        value           uniform 0;
    }
}


// ************************************************************************* //
